EDT/УТ/src/Documents/ВводДанныхОПрямыхЗатратах/ВводДанныхОПрямыхЗатратах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхОПрямыхЗатратах</name>
  <registerRecords>InformationRegister.ВводДанныхОРасходахКомпании</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиЗатрат</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДоставки</name>
      <type>
        <types>CatalogRef.КатегорииДоставки2014</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ВводДанныхОРасходахКомпании/ВводДанныхОРасходахКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВводДанныхОРасходахКомпании</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Юрлицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатратКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗатрат</name>
    <type>
      <types>EnumRef.ВидыЗатратКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗатрат</name>
    <type>
      <types>EnumRef.ТипыЗатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВидыЗатратКомпании/ВидыЗатратКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗатратКомпании</name>
  <enumValues>
    <name>ПрямыеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РаспределяемыеРасходы</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ВводДанныхОПрямыхЗатратах/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВводДанныхОРасходахКомпании
	Движения.ВводДанныхОРасходахКомпании.Записывать = Истина;
	Движения.ВводДанныхОРасходахКомпании.Очистить();
	Для Каждого ТекСтрокаСтатьиЗатрат Из СтатьиЗатрат Цикл
		Движение = Движения.ВводДанныхОРасходахКомпании.Добавить();
		Движение.Период = Дата;
		Движение.Партнер = Партнер;
		Движение.СтатьяЗатрат = ТекСтрокаСтатьиЗатрат.СтатьяЗатрат;
		Движение.ТипЗатрат = ТекСтрокаСтатьиЗатрат.СтатьяЗатрат.ТипЗатрат; 
		Движение.ВидЗатрат = Перечисления.ВидыЗатратКомпании.ПрямыеРасходы;
		Движение.КатегорияДоставки = ТекСтрокаСтатьиЗатрат.КатегорияДоставки;
		Движение.ТипЗаказа = ТекСтрокаСтатьиЗатрат.ТипЗаказа;
		Движение.Сумма = ТекСтрокаСтатьиЗатрат.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
